<!-- add-pr-comment:eks_plan -->

# production/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_cloudwatch_dashboard.notify_system[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "notify_system" {
      ~ dashboard_body = (sensitive value)
        id             = "Notify-System-Overview"
        # (3 unchanged attributes hidden)
    }
  # aws_cloudwatch_dashboard.performance_bottlenecks[0] will be updated in-place
  ~ resource "aws_cloudwatch_dashboard" "performance_bottlenecks" {
      ~ dashboard_body = jsonencode(
          ~ {
              ~ widgets = [
                    # (63 unchanged elements hidden)
                    {
                        height     = 6
                        properties = {
                            legend    = {
                                position = "hidden"
                            }
                            metrics   = [
                                [
                                    {
                                        expression = "FILL(METRICS(), 0)"
                                        id         = "e1"
                                        label      = "SMS /"
                                        region     = "ca-central-1"
                                    },
                                ],
                                [
                                    "AWS/SNS",
                                    "NumberOfNotificationsDelivered",
                                    "PhoneNumber",
                                    "PhoneNumberDirect",
                                    {
                                        color   = "#08aad2"
                                        id      = "m1"
                                        label   = "min"
                                        region  = "ca-central-1"
                                        visible = false
                                    },
                                ],
                            ]
                            period    = 60
                            region    = "ca-central-1"
                            sparkline = true
                            stacked   = false
                            stat      = "Sum"
                            title     = "SNS/SMS Send Rate Per Minute"
                            view      = "timeSeries"
                        }
                        type       = "metric"
                        width      = 6
                        x          = 12
                        y          = 1
                    },
                  ~ {
                      ~ properties = {
                          ~ metrics   = [
                              - [
                                  - {
                                      - expression = "FILL(METRICS(), 0)"
                                      - id         = "e1"
                                      - label      = "Pinpoint /"
                                      - period     = 60
                                      - region     = "ca-central-1"
                                    },
                                ],
                              - [
                                  - "LogMetrics",
                                  - "pinpoint-sms-successes",
                                  - {
                                      - id      = "m1"
                                      - label   = "min"
                                      - region  = "ca-central-1"
                                      - visible = false
                                    },
                                ],
                              + [
                                  + "AWS/SMSVoice",
                                  + "NumberOfTextMessagePartsSent",
                                  + {
                                      + region = "ca-central-1"
                                    },
                                ],
                            ]
                          ~ title     = "Pinpoint Send Rate Per Minute" -> "Pinpoint Fragments Send Rate Per Minute"
                            # (6 unchanged attributes hidden)
                        }
                        # (5 unchanged attributes hidden)
                    },
                    {
                        height     = 1
                        properties = {
                            markdown = "# Send Rates"
                        }
                        type       = "text"
                        width      = 24
                        x          = 0
                        y          = 0
                    },
                    # (3 unchanged elements hidden)
                ]
            }
        )
        id             = "Performance-Bottlenecks"
        # (3 unchanged attributes hidden)
    }
  # aws_eks_node_group.notification-canada-ca-eks-node-group-k8s will be updated in-place
  ~ resource "aws_eks_node_group" "notification-canada-ca-eks-node-group-k8s" {
        id                     = "notification-canada-ca-production-eks-cluster:notification-canada-ca-production-eks-primary-node-group-k8s"
      ~ release_version        = "1.33.4-20250904" -> "1.33.5-20250920"
        tags                   = {
            "CostCenter"             = "notification-canada-ca-production"
            "Name"                   = "notification-canada-ca"
            "karpenter.sh/discovery" = "notification-canada-ca-production-eks-cluster"
        }
        # (17 unchanged attributes hidden)
        # (3 unchanged blocks hidden)
    }
  # aws_secretsmanager_secret_version.eks_karpenter_ami_id must be replaced
-/+ resource "aws_secretsmanager_secret_version" "eks_karpenter_ami_id" {
      ~ arn                  = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:ca-central-1:296255494825:secret:EKS_KARPENTER_AMI_ID-ApW79n|terraform-20250917141617743200000002" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20250917141617743200000002" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }
  # module.sentinel_forwarder.aws_lambda_function.sentinel_forwarder will be updated in-place
  ~ resource "aws_lambda_function" "sentinel_forwarder" {
        id                             = "sentinel-cloud-watch-forwarder"
      ~ layers                         = [
          ~ (sensitive value),
        ]
        tags                           = {
            "CostCentre" = "notification-canada-ca-production"
        }
        # (30 unchanged attributes hidden)
        # (4 unchanged blocks hidden)
    }
Plan: 1 to add, 4 to change, 1 to destroy.

# --- End of Plan 1 ---

```